import React from 'react'
import styled from '@emotion/styled'
import { Typography } from '@mui/material'
import { ListItem, List } from '@material-ui/core'
import { mainInfoSelector } from 'redux/main/mainSelectors'
import { useSelector } from 'react-redux'
const Wrapper = styled.div`
  & * {
    font-family: var(--primaryFont);
  }
  & li::before {
    content: '';
    display: block;
    width: 8px;
    height: 8px;
    border-radius: 50%;
    background: var(--greenColor);
    position: absolute;
    top: 12px;
    left: -10px;
  }
`
export const Agreement = () => {
  const main = useSelector(mainInfoSelector)
  return (
    <Wrapper>
      <Typography>
        Ця угода регулює відносини між Власником Сайту, і Вами (далі — Користувач), що виникають у звязку з
        використанням Сайту.
      </Typography>
      <h3>Терміни Угоди</h3>
      <Typography>Для цілей даної Угоди наступні слова і вирази мають такі значення:</Typography>
      <List>
        <ListItem>
          Власник - Товариство з обмеженою відповідальністю {main.name} знаходиться за адресою:
          {main.address}, що є однією зі сторін Угоди.
        </ListItem>
        <ListItem>
          Користувач - це будь-яка особа, яка звертається, підключається або надає будь-якій сторонній особі допомогу в
          отриманні будь-якого роду інформації або інформаційного наповнення, які розміщені на Сайті Власника, а так
          само і повязані зі даним Сайтом посиланнями, завантаженими з Сайту, або отриманими шляхом звернення до Сайту,
          в тому числі та, що добровільно пройшла реєстрацію на Сайті і є однією зі сторін Угоди.
        </ListItem>
        <ListItem>Угода - дана Угода, укладена Власником і Користувачем.</ListItem>
        <ListItem>
          Сторона і Сторони - означає відповідно Власника або Користувача окремо, або Власника і Користувача спільно.
        </ListItem>
        <ListItem>
          Реєстрація - процедура, в ході якої Користувач надає дані про себе у затвердженній Власником формі. Реєстрація
          вважається завершеною тільки в разі успішного проходження Користувачем всіх її етапів, включаючи активацію,
          здійснювану шляхом натискання кнопки «Реєстрація», що є автоматичним підтвердженням добровільної реєстрації
          Користувача, без натискання відповідної кнопки Реєстрація не провадиться — обліковий запис не створюється.
          Користувач цим визнає, що дає згоду на автоматизовану, а також без використання засобів автоматизації, обробку
          його персональних даних, що надаються їм при реєстрації Власнику.
        </ListItem>
        <ListItem>
          Логін - адреса Електронної пошти Користувача, що використовується для ідентифікації Користувача, і в поєднанні
          з Паролем дозволяє отримати доступ Користувача до всіх або окремих сервісів / модулів Сайту.
        </ListItem>
        <ListItem>
          Пароль - буквено-цифровий код, згенерований Користувачем і наданий Власнику в процесі проходження реєстрації,
          що зберігається обома сторонами Угоди в таємниці від третіх осіб, і який використовується в поєднанні з
          логіном для отримання доступу Користувача до сервісів / модулів Сайту.
        </ListItem>

        <ListItem>
          Реєстраційні дані Користувача - дані, добровільно зазначені Користувачем при проходженні реєстрації (ПІБ,
          контактний телефон, адреса електронної пошти). Дані зберігаються Власником і підлягають використанню виключно
          відповідно до Угоди та законодавства України.
        </ListItem>
        <ListItem>
          Сайт - інформаційний проект Власника, розміщений в мережі Інтернет за адресою: {window.location.host} і його
          дзеркал. Дозволяє за допомогою глобальної мережі Інтернет і різних електронних пристроїв переглядати в режимі
          онлайн різний Контент Сайту..
        </ListItem>
        <ListItem>
          Контент Сайту - інформація, що розміщуються Власником, текстові матеріали, фотоматеріали, інші статичні
          зображення, відеоматеріали, які доступні до перегляду без стягнення з Користувача плати.
        </ListItem>
        <ListItem>
          Особистий кабінет (Обліковий запис) Користувача - відомості, сформовані в результаті Реєстрації, необхідні в
          тому числі для ідентифікації Користувача і його доступу до окремих сервісів / модулів Сайту, включаючи, але не
          обмежуючись: Логін, Пароль.
        </ListItem>
      </List>
      <h3>Загальні положення</h3>
      <Typography>
        Угода встановлює правила і умови використання Сайту Користувачами, які після Реєстрації або без такої,
        здійснюють використання Сайту і його служб, стають Користувачами Сайту і послуг, що надаються Власником.
      </Typography>
      <Typography>
        Ця Угода про використання Сайту укладається між Власником і будь-яким Користувачем. Звернення до будь-якого з
        розділів Сайту, як і розміщення на нього посилань, цитування та передрук Контенту Сайту, мають на увазі юридично
        зобовязуючу згоду Користувача на повне і беззастережне дотримання умов і положень цієї Угоди.
      </Typography>

      <Typography>
        Ця Угода не є договором. Власник Сайту залишає за собою право, як змінити цю Угоду, так і ввести нове. Подібні
        зміни вступають в силу з моменту їх розміщення на Сайті. Використання Користувачем матеріалів Сайту після зміни
        Угоди автоматично означає їх прийняття.
      </Typography>
      <Typography>
        Якщо Ви (Користувач) не згодні дотримуватися Угоди, не використовуйте Сайт, а якщо Ви являєтеся зареєстрованим
        Користувачем, негайно припиніть використання Сайтуа.
      </Typography>
      <Typography>
        Користувач зобовязується регулярно знайомитися зі змістом Угоди з метою своєчасного ознайомлення з її змінами.
      </Typography>
      <Typography>
        Призначенням Сайту є ознайомлення Користувача з контентом сайту і забезпечення інформаційної підтримки
        користувачів.
      </Typography>

      <Typography>
        Забороняється будь-яке незаконне використання цього Сайту, розміщеної на ньому інформації та інших матеріалів.
      </Typography>
      <Typography>
        Ніщо в Угоді не може тлумачитись або розумітися як встановлення між Власником та Користувачем агентських
        відносин, відносин товариства, відносин по спільній діяльності, відносин особистого найму або інших відносин,
        прямо не передбачених Угодою.
      </Typography>
      <Typography>
        Власник має право поєднувати розміщені Користувачами на Сайті повідомлення або відгуки з інформацією рекламного
        характеру в формі графічних або текстових модулів (банерів).
      </Typography>
      <h3>Правила використання Інформаційних та інших матеріалів Сайту</h3>
      <Typography>
        Будь-яке використання інформації та матеріалів Сайту допускається тільки з дозволу Власника Сайту. Під
        використанням Інформації Сайту мається на увазі — будь-яке відтворення, поширення, переробка й інші способи
        використання, передбачені Законом України «Про авторське право і суміжні права».
      </Typography>
      <Typography>
        Будь-яке використання інформації та інших матеріалів, розміщених на Сайті, вимагає письмового дозволу Власника
        Сайту із зазначенням способу дозволеного використання, терміну використання, умов використання.
      </Typography>
      <h3>Права та обовязки Користувача</h3>
      <Typography>
        Користувач зобовязується використовувати Сайт тільки в законних цілях, дотримуватися чинного законодавства
        України, а також права та законних інтересів Власника і правовласників, чий Контент розміщений на Сайті.
      </Typography>
      <Typography>
        Користувач зобовязаний не використовувати Сайт для Реєстрації більше одного облікового запису на одне і те ж
        обличчя
      </Typography>

      <Typography>
        Користувач зобовязаний утримуватися від здійснення дій, спрямованих на дестабілізацію роботи Сайту, здійснення
        спроб несанкціонованого доступу до Сайту, а також від здійснення будь-яких інших дій, що порушують права
        Власника та / або третіх осіб.
      </Typography>
      <Typography>
        Користувач зобовязується не направляти через / за допомогою Сайту матеріали, які є рекламою будь-яких товарів
        або послуг, без отримання попередньої письмової згоди Власника. Користувач зобов&apos;язується не
        використовувати Сайт для реклами або іншого стимулювання збуту будь-яких товарів і послуг..
      </Typography>
      <Typography>
        Користувач не має права відтворювати, повторювати, копіювати, продавати, перепродавати, а також використовувати
        будь-яким способом для будь-яких комерційних цілей Сайт та (або) будь-які частини вмісту Сайту без згоди
        Власника..
      </Typography>
      <Typography>
        Користувач має право припинити використання Сайту і відмовитися від створеного ним облікового запису, надіславши
        Власнику на адресу електронної пошти i {main.support_email} зі своєї адреси Електронної пошти, зазначеної при
        реєстрації, запит на видалення облікового запису з Сайту. Адміністратор видаляє обліковий запис Користувача
        протягом 10 (десяти) робочих днів після отримання такого запиту, що відповідає умовам, зазначеним вище.
      </Typography>

      <Typography>
        Користувач зобовязаний вживати належних заходів для забезпечення збереження даних свого Облікового запису
        Користувача (включаючи адресу електронної пошти, логін і пароль) і несе відповідальність за всі дії, вчинені на
        Сайті під його обліковим записом. У зв&apos;язку із зазначеним, Користувач зобов&apos;язаний здійснювати вихід
        зі свого Облікового запису (завершувати кожну сесію по кнопці «Вихід») перед переходом на сторонні сайти або
        закриттям браузера (Інтернет-оглядача). Користувач зобов&apos;язаний негайно повідомити Власника про будь-які
        випадки доступу на Сайт третіми особами під Обліковим записом Користувача. Користувач не має права передавати,
        знижувати ціну, продавати, передавати в користування і т.п. Обліковий запис на Сайті третім особам без згоди
        Власника.
      </Typography>
      <Typography>
        Користувач зобовязаний періодично оновлювати персональну інформацію, яку він представив при Реєстрації, щоб
        забезпечити її точність, актуальність і повноту.
      </Typography>
      <Typography>
        Користувач несе повну відповідальність за будь-які дії, вчинені ним з використанням його Облікового запису, а
        також за будь-які наслідки, які могли спричинити або спричинили подібне використання.
      </Typography>

      <Typography>
        Користувач зобовязаний використовувати отриману на Сайті інформацію виключно в законних і особистих
        некомерційних цілях, що не суперечать моральним принципам і загальновизнаним цінностям.
      </Typography>
      <Typography>
        Користувач зобовязується не намагатися змінювати або модифікувати ніяку частину Сайту, а також не
        використовувати Сайт і розміщений на ньому Контент в комерційних цілях.
      </Typography>
      <Typography>
        Користувачі несуть відповідальність за власні дії у зв&apos;язку зі створенням і розміщенням коментарів,
        повідомлень або відгуків на Сайті, а також у зв&apos;язку з розміщенням інформації в Обліковому записі
        відповідно до чинного законодавства України.
      </Typography>
      <Typography>
        Користувачеві при використанні Сайту забороняється завантажувати, зберігати, публікувати, поширювати і надавати
        доступ або іншим чином використовувати будь-яку інформацію, яка:
      </Typography>
      <List>
        <ListItem>
          містить погрози, дискредитує, ображає, принижує честь і гідність чи ділову репутацію, або порушує
          недоторканність приватного життя інших користувачів або третіх осіб;
        </ListItem>
        <ListItem>
          є вульгарною або непристойною, містить нецензурну лексику, містить порнографічні тексти або тексти
          сексуального характеру;
        </ListItem>
        <ListItem>містить опис засобів і способів суїциду, будь-яке підбурювання до його здійснення;</ListItem>
        <ListItem>
          пропагує і / або сприяє розпалюванню расової, релігійної, етнічної ненависті або ворожнечі, пропагує фашизм чи
          ідеологію расової переваги;
        </ListItem>

        <ListItem>
          пропагує злочинну діяльність або містить поради, інструкції або керівництва по здійсненню злочинних дій;
        </ListItem>
        <ListItem>
          містить інформацію обмеженого доступу, включаючи, але не обмежуючись, державну та комерційну таємницю,
          інформацію про приватне життя третіх осіб;
        </ListItem>
        <ListItem>містить рекламу;</ListItem>

        <ListItem>носить шахрайський характер;</ListItem>

        <ListItem>
          є інтелектуальною власністю третіх осіб, що не давали дозвіл Користувачу на її використання, а також порушує
          інші права та інтереси громадян, юридичних осіб або вимоги законодавства України.
        </ListItem>
        <Typography>
          Користувач зобов&apos;язаний виконувати інші обов&apos;язки, встановлені Угодою, виконувати вказівки і вимоги
          Власника..
        </Typography>
      </List>
      <h3>Права і обов&apos;язки Власника</h3>
      <Typography>
        Обов&apos;язки Власника полягають виключно в забезпеченні надання технічної можливості отримання Користувачем
        демонстраційного доступу до Сайту в порядку, визначеному Угодою.
      </Typography>
      <Typography>
        Власник залишає за собою право на свій власний розсуд змінювати або видаляти будь-яку опубліковану на Сайті
        інформацію, а також фото- та відеоконтент, і будь-які елементи, і складові частини Сайту, припиняти, обмежувати
        або забороняти доступ Користувача до всіх або до будь-якого з розділів / модулів сайту в будь-який час з
        будь-якої причини або без пояснення причин, з попереднім повідомленням або без такого (на розсуд Власника). При
        цьому Сторони погоджуються, що Власник не відповідає за будь-яку шкоду, яка може бути заподіяна Користувачеві
        такими діями.
      </Typography>
      <Typography>
        Власник має право встановлювати будь-які обмеження у використанні Сайту, в будь-який час змінювати Угоду в
        односторонньому порядку без отримання згоди Користувача.
      </Typography>
      <Typography>
        Власник має право здійснювати розсилання Користувачам повідомлень на Електронну пошту, вказану Користувачами при
        реєстрації, що містять організаційно-технічну або іншу інформацію. Якщо Власнику стане відомо, що Електронна
        пошта зареєстрованого Користувача не існує або є нечинною, Реєстрація відповідного Користувача буде припинена.
      </Typography>
      <Typography>
        Власник має право надати Користувачеві можливість створення єдиного персонального Облікового запису. У разі
        створення Користувачем більше одного Облікового запису Власник залишає за собою право відмовити в створенні
        Користувачеві дублюючого Облікового запису та / або відмовити Користувачеві в використанні Сайту..
      </Typography>
      <Typography>
        Власник має право розміщувати рекламну і / або іншу інформацію в будь-якому розділі сайту.
      </Typography>
      <Typography>Власник зобов&apos;язаний не здійснювати наступних дій:</Typography>
      <List>
        <ListItem>
          Розміщувати будь-які файли, які містять або можуть містити віруси та інші шкідливі програми;
        </ListItem>
        <ListItem>
          Описувати або пропагувати злочинну діяльність, розміщувати інструкції або керівництва по здійсненню злочинних
          дій;
        </ListItem>
        <ListItem>
          Розміщувати на Сайті будь-яку інформацію, що порушує виключні права користувачів або третіх осіб.
        </ListItem>
      </List>
      <Typography>
        Власник має право не займатися попередньою модерацією або цензурою коментарів і відгуків користувачів і вживати
        заходів щодо захисту прав та інтересів осіб і забезпечення дотримання вимог законодавства України тільки після
        звернення зацікавленої особи до Власника в установленому Власником порядку і / або інших випадках, передбачених
        Угодою.
      </Typography>
      <Typography>
        Власник не несе відповідальність за отримання доступу третіми особами до особистої інформації користувачів, якщо
        такий доступ став можливий з вини користувачів або в результаті неправомірних дій третіх осіб.
      </Typography>
      <h3>Персональні дані</h3>
      <Typography>
        Перед заповненням своїх персональних даних, Користувач дає свою згоду Власнику на збір і обробку (накопичення,
        зберігання, адаптування, відновлення, використання, поширення, знеособлення і знищення) зазначених даних, а
        саме: прізвище, ім&apos;я та по батькові, логін і пароль доступу електронної пошти, номери контактних телефонів,
        адреси, дати і місця народження, ідентифікаційного номера, стать, громадянство; країна проживання, місце роботи,
        посада) з метою забезпечення реалізації відносин у сфері захисту прав споживачів, у сфері реклами і
        маркетингових досліджень, а також дає свою згоду на передачу (поширення) його даних іншим
        транспортно-експедиторським і кур&apos;єрським організаціям, будь-яким Банкам і / або фінансовим установам і
        іншим третім особам (без обмеження) на розсуд ТОВ «МІС-Cервіс». Дане положення діє без обмеження терміну дії.
      </Typography>

      <Typography>
        Джерелом збору персональних даних є інформація, свідомо і добровільно надана Користувачем як суб&apos;єктом
        персональних даних в цілях використання сервісів Сайту.
      </Typography>
      <Typography>
        Власником і розпорядником Ваших персональних даних є {main.name}. Місцезнаходження:
        {main.address}. База персональних даних «Клієнти» знаходиться за адресою ТОВ
        {main.address}.
      </Typography>
      <Typography>
        Суб&apos;єкт персональних даних відповідно до Закону України «Про захист персональних даних», має право:
      </Typography>

      <List>
        <ListItem>
          знати про джерела збору, місцезнаходження своїх персональних даних, мету їх обробки, місцезнаходження або
          місце проживання (перебування) власника чи розпорядника персональних даних або дати відповідне доручення щодо
          отримання цієї інформації уповноваженим ним особам, крім випадків, встановлених законом;
        </ListItem>

        <ListItem>
          отримувати інформацію про умови надання доступу до персональних даних, зокрема інформацію про третіх осіб,
          яким передаються його персональні дані;
        </ListItem>
        <ListItem>на доступ до своїх персональних даних;</ListItem>
        <ListItem>
          отримувати не пізніше, ніж за тридцять календарних днів з дня надходження запиту, крім випадків, передбачених
          законом, відповідь про те, чи обробляються або зберігаються його персональні дані, а також отримувати зміст
          його персональних даних, які зберігаються;
        </ListItem>
        <ListItem>
          висувати вмотивовану вимогу власнику персональних даних із запереченням проти обробки своїх персональних
          даних;
        </ListItem>

        <ListItem>
          висувати вмотивовану вимогу щодо зміни або знищення своїх персональних даних будь-яким власником і
          розпорядником персональних даних, якщо ці дані обробляються незаконно чи вони недостовірні;
        </ListItem>
        <ListItem>
          на захист своїх персональних даних від їх незаконної обробки та випадкової втрати, знищення, пошкодження у
          зв&apos;язку з умисним приховуванням, ненаданням чи несвоєчасним їх наданням, а також на захист від надання
          відомостей, що є недостовірними чи ганьблять честь, гідність та ділову репутацію фізичної особи;
        </ListItem>
        <ListItem>
          звертатися зі скаргами на обробку своїх персональних даних до органів державної влади та посадових осіб, які
          уповноважені забезпечувати захист персональних даних, або до суду;
        </ListItem>

        <ListItem>
          застосовувати засоби правового захисту в разі порушення законодавства про захист персональних даних;
        </ListItem>
        <ListItem>
          вносити застереження про обмеження прав на обробку своїх персональних даних при наданні згоди;
        </ListItem>
        <ListItem>
          відкликати згоду на обробку персональних даних; знати механізм автоматичної обробки персональних даних;
        </ListItem>
        <ListItem>на захист від автоматизованого рішення, яке має для нього правові наслідки.</ListItem>

        <Typography>
          Користувач, погоджуючись на збір і обробку своїх персональних даних, підтверджує, що обізнаний про включення
          інформації про нього до бази персональних даних з вищезазначеною метою, про свої права, визначені Законом
          України «Про захист персональних даних», а також про осіб, яким його дані передаються для виконання
          вищезазначеної мети.
        </Typography>
        <Typography>
          Користувач підтверджує, що повністю розуміє цільове призначення Сайту, обробки його даних.
        </Typography>
        <Typography>
          Ознайомитися з політикою конфіденційності та захисту персональних даних можливо за посиланням
        </Typography>
        <h3>Відповідальність. Обмеження відповідальності</h3>
        <Typography>
          Користувач прямо погоджується, що використовує Інформаційні матеріали про Лікарські засоби, розміщені на Сайті
          {window.location.host}, що служать для ознайомлення і не можуть використовуватися як рекомендація щодо
          застосування або як джерело інформації з самолікування і можуть бути застосовані виключно за рецептом лікаря і
          під лікарським наглядом, якщо інше прямо не передбачено чинним законодавством України.
        </Typography>
        <Typography>
          Сайт не призначений для Користувачів, які не досягли повноліття і для недієздатних Користувачів. У разі
          випадкового візиту на Сайт, такі Користувачі зобов&apos;язані покинути його. Власник сайту не несе
          відповідальності за будь-які небажані наслідки в разі невиконання цієї вимоги Користувачами.
        </Typography>

        <Typography>
          Користувачі Сайту з юрисдикцій, інших, ніж Україна, повинні використовувати Інформацію про Лікарські засоби
          відповідно до правил, які діють на території таких юрисдикцій.
        </Typography>
        <Typography>
          Власник Сайту не несе відповідальності за можливу шкоду, завдану вашому здоров&apos;ю, в зв&apos;язку з
          самостійним використанням Інформації, розміщеної на Сайті. Користувач повністю відповідає за будь-яке
          неправильне трактування, яке може виникнути внаслідок перегляду, читання або копіювання матеріалів, що
          містяться на Сайті і таким чином ніяка юридична або фізична особа не може бути відповідальна за використання
          згаданих матеріалів. Ні в якому разі відповідальність за наслідки, які прямо або опосередковано спричинені
          використанням Контенту Сайту, не може покладатися на Власника Сайту і бути підставою для судового
          переслідування.
        </Typography>
        <Typography>
          Послуги Сайту надаються за принципом «як є» без гарантій будь-якого роду, як прямих, так і непрямих.
          Користувач в добровільному порядку відмовляється від судового і адміністративного переслідування Власника
          Сайту і будь-яких вимог про відшкодування можливої шкоди, заподіяної здоров&apos;ю Користувача.
        </Typography>

        <Typography>
          Контент Сайту надається без гарантії того, що він не може містити помилки. Власник Сайту має право змінювати
          Контент Сайту, включаючи без всяких обмежень переміщення або видалення Контенту Сайту на свій власний розсуд,
          за будь-якої причини або без причини, в будь-який час і без попереднього оголошення про такі зміни.
        </Typography>
        <Typography>
          Власник гарантує не розголошувати дані Користувача, отримані при реєстрації, за винятком випадків,
          передбачених законодавством України.
        </Typography>
        <Typography>
          Користувач повністю відповідальний за збереження свого Логіна і Пароля і за збитки, які можуть виникнути
          внаслідок їх втрати або несанкціонованого використання його Облікового запису. Власник не несе
          відповідальності і не відшкодовує збитки, що виникли внаслідок несанкціонованого використання третіми особами
          Логіна і Пароля Облікового запису Користувача. Всі дії, вчинені відвідувачем, який авторизувався за допомогою
          Логіна і Пароля Користувача, розглядаються як дії Користувача. Користувач несе повну відповідальність за всі
          дії, вчинені авторизованою особою від його імені.
        </Typography>

        <Typography>
          Власник не несе відповідальності за будь-які збитки електронним пристроям Користувача або іншої особи,
          мобільним пристроям, будь-якому іншому обладнанню або програмному забезпеченню, що викликані або
          пов&apos;язані з використанням Сайту.
        </Typography>
        <Typography>
          Власник не несе відповідальності перед Користувачем або будь-якими третіми особами за дії Користувача на
          Сайті.
        </Typography>
        <Typography>
          Власник не несе відповідальності за порушення Користувачем Угоди і залишає за собою право на свій власний
          розсуд, а також при отриманні інформації від будь-яких третіх осіб про порушення Користувачем Угоди або прав
          та інтересів третіх осіб, змінювати (модерувати) або видаляти будь-яку опубліковану Користувачем інформацію, а
          також призупиняти, обмежувати або припиняти доступ Користувача до всіх або до будь-якого з розділів Сайту в
          будь-який час з будь-якої причини або без пояснення причин, з попереднім повідомленням або без такого, не
          відповідаючи за будь-яку шкоду, яка може бути заподіяна Користувачеві такою дією.
        </Typography>

        <Typography>
          У разі пред&apos;явлення третіми особами претензій до Власника, пов&apos;язаних з використанням Користувачем
          Сайту, Користувач зобов&apos;язується своїми силами і за свій рахунок врегулювати розміщення в ній інформації
          з третіми особами, захистивши Власника від можливих збитків і розглядів.
        </Typography>

        <Typography>
          Сайт може містити посилання на інші ресурси мережі Інтернет. Користувач визнає і погоджується з тим, що
          Власник не контролює і не несе ніякої відповідальності за доступність цих ресурсів і за їх зміст, а також за
          будь-які наслідки, пов&apos;язані з використанням цих ресурсів. Будь-які переходи по посиланнях, які
          здійснюються Користувачем, останній вчиняє на свій страх і ризик.
        </Typography>
        <Typography>
          Власник Сайту не гарантує безперебійної та безпомилкової роботи Сайту; також не гарантовано, що такими будуть
          і результати, отримані в ході використання Сайту, так і точність, і можливість застосування його матеріалів.
        </Typography>
        <h3>Зовнішні посилання</h3>
        <Typography>
          Відповідно до умов та положень, викладених в цій Угоді, Власник надає Користувачеві невиключну, обмежену,
          відкличну, безоплатну ліцензію на розміщення гіпертекстового довідкового посилання (далі по тексту —
          &apos;Посилання&apos;) на Сайт виключно в некомерційних цілях, що не виходять за рамки з&apos;єднання сайту
          Користувача з Сайтом.
        </Typography>
        <Typography>Користувач не має права:</Typography>
        <List>
          <ListItem>
            розміщувати Посилання або користуватися ним таким чином, який приведе до виведення Сайту або будь-якого його
            елемента на екран у вигляді окремого кадру у вікні, або до появи асоціацій з будь-якого роду рекламою або
            спонсорською програмою, яка не має стосунку до Сайту, або до іншого включення інформаційного наповнення
            сайту до складу якого б то не було стороннього сайту;
          </ListItem>

          <ListItem>
            розміщувати або використовувати вбудовані посилання на який-небудь файл даних, що входить до складу Сайту;
          </ListItem>
          <ListItem>
            видозмінювати будь-який елемент Сайту, блокувати чи іншим чином перешкоджати його відображенню;
          </ListItem>

          <ListItem>
            посилатися на Сайт через будь-який сторонній уніфікований покажчик ресурсів (URL) або сайт-дублер;
          </ListItem>
          <ListItem>
            розміщувати посилання на Сайт в тому випадку, якщо вміст сайту користувача виглядає в очах розсудливої особи
            непристойним, наклепницьким, що містить в собі домагання, глибоко образливим, зловмисним або будь-яким іншим
            чином незаконним і / або таким, що порушує охоронювані законодавством права.
          </ListItem>
          <h3>Торгові марки</h3>
          <Typography>
            Зареєстровані торгові марки, знаки для товарів і послуг, комерційні найменування, що згадуються на Сайті, є
            власністю їх відповідних власників.
          </Typography>
          <h3>Заключні положення</h3>
          <Typography>
            Угода укладається на невизначений термін і поширює свою дію на Користувачів, які здійснюють доступ до Сайту
            і його використання, як до дати опублікування Угоди, так і після дати її опублікування на Сайті.
          </Typography>
          <Typography>
            Якщо з тих чи інших причин будь-які з умов Угоди є недійсними або не мають юридичної сили, це не впливає на
            дійсність або застосовність інших умов Угоди.
          </Typography>

          <Typography>
            Угода і відносини між Власником та Користувачем регулюються відповідно до законодавства України. Сторони
            Угоди зобов&apos;язуються підкорятися виключній юрисдикції судів України при виникненні спірних питань
            юридичного характеру, пов&apos;язаних з Угодою або Сайтом.
          </Typography>
          <Typography>
            Сторони погодилися, що всі суперечки, що виникають у відносинах Сторін, регулюються цією Угодою, повинні
            вирішуватися в компетентному суді за місцем знаходження Власника з обов&apos;язковим дотриманням досудового
            претензійного порядку врегулювання спорів, встановленого Угодою.
          </Typography>
          <Typography>
            Якщо Користувач не до кінця розуміє умови цієї Угоди або не згоден з будь-яким з пунктів, викладених в
            Угоді, він повинен покинути сторінки Сайту.
          </Typography>
        </List>
      </List>
    </Wrapper>
  )
}
