import styled from '@emotion/styled'
import { Typography } from '@mui/material'
import { ListItem, List } from '@material-ui/core'

const Wrapper = styled.div`
  & * {
    font-family: var(--primaryFont);
  }
  & li::before {
    content: '';
    display: block;
    width: 8px;
    height: 8px;
    border-radius: 50%;
    background: var(--greenColor);
    position: absolute;
    top: 13px;
    left: -20px;
  }
`

export const OrderReturn = () => {
  return (
    <Wrapper>
      <Typography>
        Відповідно до{' '}
        <a target='_blank' rel='noreferrer' href='https://zakon.rada.gov.ua/laws/show/z0782-05#Text'>
          наказу МОЗ від 19 липня 2005 р. № 360
        </a>{' '}
        та{' '}
        <a target='_blank' rel='noreferrer' href='https://zakon.rada.gov.ua/laws/show/172-94-%D0%BF#Text'>
          Постанови КМУ від 19.03.1994 р. № 172
        </a>{' '}
        : «Лікарські засоби та вироби медичного призначення належної якості, відпущені з аптек та їх структурних
        підрозділів, поверненню не підлягають».
      </Typography>
      <Typography>
        <a target='_blank' rel='noreferrer' href='https://zakon.rada.gov.ua/laws/show/1023-12#Text'>
          Відповідно до ст. 8. Закону України «Про захист прав споживачів»{' '}
        </a>
        : «У разі виявлення протягом встановленого гарантійного строку істотних недоліків, які виникли з вини виробника
        товару (продавця, виконавця), або фальсифікації товару, підтверджених за необхідності висновком експертизи,
        споживач, в порядку та у строки, що встановлені законодавством, і на підставі обов’язкових для сторін правил чи
        договору, має право за своїм вибором вимагати від продавця або виробника:
      </Typography>
      <List>
        <ListItem>розірвання договору та повернення сплаченої за товар грошової суми;</ListItem>
        <ListItem>
          вимагати заміни товару на такий же товар або на аналогічний, з числа наявних у продавця (виробника), товар».
        </ListItem>
      </List>
      <Typography>
        Для повернення лікарського засобу чи виробу медичного призначення НЕналежної якості, необхідно надати фіскальний
        чек та доказ того, що лікарський засіб неякісний — висновок експертизи, Розпорядження Держлікслужби про заборону
        обігу лікарського засобу тощо. Офіційним органом у сфері контролю якості лікарських засобів є{' '}
        <a target='_blank' rel='noreferrer' href='https://www.dls.gov.ua/'>
          Державна служба України з лікарських засобів та контролю за наркотиками
        </a>{' '}
        (Держлікслужба).
      </Typography>
      <Typography>
        Відповідно{' '}
        <a target='_blank' rel='noreferrer' href='https://zakon.rada.gov.ua/laws/show/1002-2021-%D0%BF#Text'>
          Постанови КМУ від 22.09.2021 р. № 1002
        </a>{' '}
        «Споживач має право відмовитися від доставленого лікарського засобу під час отримання замовлення та має право
        вимагати повернення коштів від ліцензіата, який здійснив продаж такого лікарського засобу у випадку, якщо:
      </Typography>
      <List>
        <ListItem>пошкоджено первинну та/або вторинну упаковку лікарського засобу;</ListItem>
        <ListItem>минув термін придатності лікарського засобу;</ListItem>
        <ListItem>уповноваженим органом опублікована заборона реалізації та застосування лікарського засобу;</ListItem>
        <ListItem>
          доставлене замовлення не відповідає замовленому за кількістю або складом, найменуванням, дозуванням, формою
          випуску, ціною.
        </ListItem>
      </List>
      <Typography>
        Споживач має право повернути його співробітнику служби доставки ліцензіата, який здійснив доставку, без оплати
        доставленого лікарського засобу та/або послуг з його доставки та/або вимагати належного виконання замовлення».
      </Typography>
    </Wrapper>
  )
}
