import React from 'react'
import styled from '@emotion/styled'
import { Typography } from '@mui/material'
import { ListItem, List } from '@material-ui/core'

const Wrapper = styled.div`
  & * {
    font-family: var(--primaryFont);
  }
  & li::before {
    content: '';
    display: block;
    width: 8px;
    height: 8px;
    border-radius: 50%;
    background: var(--greenColor);
    position: absolute;
    top: 13px;
    left: -20px;
  }
`

export const Terms = () => {
  return (
    <Wrapper>
      <h3>Загальні положення</h3>
      <Typography>
        Управління даним веб-сайтом www.apteka24.ua (далі — «Сайт») здійснюється ТОВ «МІС-Cервіс», код ЄДРПОУ 43826536,
        юридичною особою, що зареєстрована та здійснює свою діяльність відповідно до вимог законодавства України (далі —
        «Компанія»)
      </Typography>
      <Typography>
        У цій політиці конфіденційності і захисту персональних даних (далі — Політика) пояснюється, яка Ваша інформація
        буде збиратися ТОВ «МІС-Cервіс» при доступі до веб-сайту www.apteka24.ua (далі «веб-сайт»), до всіх
        пов&apos;язаних веб-сайтів (піддоменів), а також до інших послуг, що надаються ТОВ «МІС-Cервіс», на які
        посилається дана Політика. Відображається Політика, а також всі інші види зв&apos;язку з Вами за допомогою
        письмових або усних засобів, таких як електронна пошта або телефон. У ній також описується, як інформація буде
        використовуватися, як ви можете контролювати збір, виправлення і / або видалення інформації і як зв&apos;язатися
        з нами, якщо Вам потрібно.
      </Typography>
      <Typography>
        Справжня Політика поширюється на персональні дані, отримані як до, так і після її введення в дію.
      </Typography>

      <Typography>
        Наші методи забезпечення конфіденційності розроблені для забезпечення високого рівня захисту Ваших персональних
        даних. Ми не будемо використовувати або передавати Вашу інформацію будь-кому, крім випадків, описаних у цій
        Політиці конфіденційності. Справжня Політика визначена і регулюється Угодою використання, доступною на цьому
        сайті.
      </Typography>
      <Typography>
        Метою Політики є доведення до Вас необхідної інформації, яка дозволить оцінити, які персональні дані і з якими
        цілями обробляються нами, методи їх обробки і забезпечення безпеки.
      </Typography>
      <Typography>
        При використанні нашого сервісу Ви, повідомивши нам свої персональні дані, в тому числі за допомогою третіх
        осіб, визнаєте свою згоду на обробку своїх персональних даних відповідно до цієї Політики.
      </Typography>

      <Typography>
        У разі незгоди з умовами цієї Політики, Ви зобов&apos;язані припинити використовувати наш сервіс.
      </Typography>
      <Typography>
        Нами не перевіряється достовірність персональних даних, наданих Вами, ми не маємо можливості оцінювати Вашу
        дієздатність. При цьому ми припускаємо, що Ви дієте сумлінно, обачно, надаєте достовірні та достатні персональні
        дані, а також докладаєте всіх необхідних зусиль у підтримці таких даних в актуальному стані і не порушуєте права
        третіх осіб.
      </Typography>
      <Typography>
        Погоджуючись з умовами цієї Політики, Ви підтверджуєте, що в момент збору персональних даних, Ви повідомлені про
        осіб, яким передаються персональні дані, зміст і цілі збору персональних даних. Ви підтверджуєте (гарантуєте),
        що персональні дані, які передали нам на обробку, передані за згодою власників персональних даних і в рамках
        Законодавства.
      </Typography>

      <Typography>
        Ви також погоджуєтеся з тим, що Власник персональних даних має право надавати доступ та передавати Ваші
        персональні дані третім особам без будь-яких додаткових повідомлень, виключно у тому випадку, якщо при цьому не
        змінюється мета їх обробки, і тільки у випадках, передбачених цією Політикою конфіденційності та / або
        законодавством України.
      </Typography>
      <Typography>
        Особи віком до 18 років не повинні надавати нам персональну інформацію через Онлайн-сервіс. Нами не збирається
        цілеспрямовано персональна інформація осіб молодше 18 років. Батьки та опікуни повинні постійно контролювати
        пов&apos;язану з цим діяльність своїх дітей.
      </Typography>
      <Typography>
        Будь ласка, уважно прочитайте цю Політику конфіденційності, щоб зрозуміти наші погляди і практику щодо Ваших
        особистих даних, перш ніж переглядати цей веб-сайт.
      </Typography>
      <h3>1. Збір та використання персональних даних</h3>

      <Typography>Власником і розпорядником Ваших персональних даних є ТОВ «МІС-Cервіс».</Typography>
      <Typography>
        Компанія збирає тільки ті персональні дані (наприклад, Ваше ім&apos;я і прізвище, логін і пароль доступу до
        особистого кабінету на сайті www.apteka24.ua, адрес электронной почты, номер контактного телефона, дата
        рождения, пол и т.д.), адресу електронної пошти, номер контактного телефону, дату народження, стать і т.д.), які
        свідомо і добровільно надані Вами як суб&apos;єктом персональних даних в цілях використання сервісів Сайту, що
        відповідно до вимог законодавства є згодою суб&apos;єкта персональних даних на обробку своїх персональних даних
        відповідно до сформульованої в цій Політиці метою їх обробки.
      </Typography>
      <Typography>
        Склад персональних даних. Для здійснення своєї діяльності і для виконання своїх зобов&apos;язань нами
        обробляються Ваші персональні дані, надані при реєстрації на сайті www.apteka24.ua і зберігаються в особистому
        кабінеті.
      </Typography>
      <Typography>
        До персональних даних належать: прізвище, ім&apos;я, по-батькові, адреса електронної пошти, номер мобільного /
        стаціонарного телефону, країна проживання, місце роботи, посада, дата народження.
      </Typography>
      <Typography>
        Ми просимо повідомляти тільки ті персональні дані, які необхідні для надання обраної Вами послуги, отримання
        інформаційної розсилки або відповіді на Ваш спеціальний запит. Якщо Ви повідомите нам додаткові персональні
        дані, ми також зможемо обробити їх з необхідним рівнем захисту..
      </Typography>

      <Typography>
        Дані, які автоматично нам передаються при використанні Вами нашого сервісу за допомогою встановленого на
        пристрої програмного забезпечення: IP-адреса, інформація про браузер і вид операційної системи пристрою,
        технічні характеристики обладнання і програмного забезпечення, дата і час доступу до онлайн-сервісу.
      </Typography>

      <List>
        <ListItem>
          Ми запитуємо Ваші персональні та контактні дані тільки для здійснення Вашого замовлення і надання необхідної
          інформації про стан його виконання, реєстрації в особистому кабінеті клієнта, участі в рекламних активностях
          ТОВ «МІС-Cервіс» тощо
        </ListItem>

        <ListItem>
          Ваші персональні дані обробляються ТОВ «МІС-Cервіс» виключно в рамках Закону України «Про захист персональних
          даних». Такі дані, відповідно до вимог законодавства, що регулює правовідносини, пов&apos;язані із захистом
          персональних даних, зберігаються, обробляються і використовуються в рамках всіх правовідносин, що виникають
          між Вами і ТОВ «МІС-Cервіс». Усі правовідносини, пов&apos;язані з обробкою та захистом персональних даних,
          регулюються відповідним законодавством.
        </ListItem>

        <ListItem>Ваші персональні дані обробляються в наступних випадках:</ListItem>
        <ListItem>
          при здійсненні (підтвердженні) Вами замовлення на сайті apteka24.ua, тобто при придбанні товарів і / або
          послуг, шляхом кліка в рядку «Оформити замовлення і відправити замовлення»;
        </ListItem>
        <ListItem>при реєстрації в особистому кабінеті клієнта на сайті apteka24.ua;</ListItem>

        <ListItem>
          за участю в рекламних активностях ТОВ «МІС-Cервіс» відповідно до правил проведення таких заходів.
        </ListItem>
        <ListItem>
          Також ви повинні надати свою згоду на передачу (поширення) компанією ТОВ «МІС-Cервіс» ваших даних
          транспортно-експедиторським і кур&apos;єрським організаціям, банкам або фінансовим установам і іншим третім
          особам, які забезпечують виконання Вашого замовлення на придбання товарів або виконання замовлених послуг.
        </ListItem>

        <ListItem>
          Такий перелік порядку надання згоди на обробку Ваших персональних даних не є вичерпним і узгоджується ТОВ
          «МІС-Cервіс» і клієнтом (споживачем) і / або доводиться до відома клієнта (споживача).
        </ListItem>

        <ListItem>
          ТОВ «МІС-Cервіс» гарантує, що персональні дані будуть зберігатися і оброблятися у відповідності до вимог
          Закону України «Про захист персональних даних»..
        </ListItem>
        <ListItem>
          ТОВ «МІС-Cервіс» використовує всі необхідні (cookies) куки, щоб забезпечити Вам надання максимально повної
          інформації про нас і наших можливостей, щоб Ви отримали якнайкращий досвід на нашому сайті. Якщо Ви
          продовжуєте користуватися нашим сайтом, це означає Вашу згоду на використання нами (cookies) і отримання Вами
          всіх файлів cookie, і нашу можливість відправляти Вам найсвіжішу інформацію про найактуальніші пропозиції та
          акції. Ви в будь-який час можете легко відмовитися від розсилки або заборонити використовувати куки шляхом
          персональних налаштувань Вашого девайса.
        </ListItem>
        <ListItem>
          При відвідуванні сайту apteka24.ua ми збираємо, зберігаємо і обробляємо таку інформацію як IP-адресу, дату і
          час відвідин, тип і мову браузера, файли cookies — виключно для надання послуг сайту і оптимізації його
          роботи, а також для захисту цілісності інформаційного простору сайту.
        </ListItem>

        <ListItem>
          Ця інформація є конфіденційною і не передається третім особам, крім обґрунтованих випадків, передбачених
          законами України, на прохання суб&apos;єкта персональних даних або в інших випадках, викладених в даній
          Політиці.
        </ListItem>
      </List>
      <h3>2. Цілі використання персональних даних</h3>
      <Typography>
        Ваші персональні дані використовуються з метою забезпечення надання сервісів сайту відповідно та для виконання
        законів України, в тому числі, але не виключно: «Про захист персональних даних», «Про інформацію», «Про
        рекламу», «Про телекомунікації», «Про захисту інформації в інформаційно-телекомунікаційних системах»,
        Генерального регламенту про захист даних (ЄС) 2016/679 від 27.04.2016 р (EU General Data Protection Regulation,
        далі — GDPR) та іншого застосовного Європейського законодавства про захист даних, спільно іменоване далі —
        Законодавство, а також відповідно до Угоди про використання сайту та інших актів, що регулюють діяльність
        Компанії.
      </Typography>
      <Typography>
        <strong>Метою обробки Ваших персональних даних є:</strong>
      </Typography>

      <List>
        <ListItem>здійснення покладених на нас функцій відповідно до законодавства України і GDPR;</ListItem>
        <ListItem>
          збір, зберігання і обробка персональних даних, отриманих в онлайн-сервісі в рамках Закону і GDPR;
        </ListItem>

        <ListItem>
          для відправлення Вам комерційних (маркетингових) повідомлень, що містять додаткову інформацію про послуги,
          актуальні акції та спеціальні пропозиції, що стосуються послуг, котрі надаються нами за допомогою нашого
          онлайн-сервісу;
        </ListItem>
        <ListItem>ідентифікація суб&apos;єкта персональних даних при використанні онлайн-сервісу;</ListItem>
        <ListItem>
          зв&apos;язок з суб&apos;єктом персональних даних у разі необхідності, в тому числі, напрямок пропозицій,
          інформаційних матеріалів, повідомлень, інформації та запитів, реклами, а також обробки запитів суб&apos;єкта
          персональних даних;
        </ListItem>

        <ListItem>
          поліпшення якості онлайн-сервісу, зручності його використання, розробка нових функціональних можливостей і
          поліпшення якості обслуговування;
        </ListItem>
        <ListItem>проведення статистичних та інших досліджень на основі знеособлених даних.</ListItem>
      </List>
      <h3>3. Використання файлів Cookies</h3>

      <Typography>
        Cookie — це текстовий файл або файли, що містять невеликий обсяг інформації, які відправляються веб-браузеру і
        зберігаються на Вашому пристрої (комп&apos;ютер, мобільний телефон або інший пристрій, за допомогою якого Ви
        відвідуєте Сайт)..
      </Typography>
      <Typography>
        Сookie-файли можуть бути постійними і зберігатися в комп&apos;ютері, поки Ви їх не видалите, або тимчасовими /
        сесійними — вони зберігаються тільки до закриття браузера. .
      </Typography>

      <Typography>Звертаємо увагу, що:</Typography>
      <List>
        <ListItem>при повторному відвідуванні Вами сайту дані файлів cookie оновлюються;</ListItem>
        <ListItem>
          в більшості випадків веб-браузер за замовчуванням допускає автоматичне збереження файлів cookie на своєму
          пристрої;
        </ListItem>
        <ListItem>
          відключення файлів cookie може призвести до обмеження доступу до опублікованих матеріалів і / або
          неповноцінного функціонування сервісів Сайту.
        </ListItem>
      </List>

      <Typography>
        Ми робимо все для того, щоб зробити Ваше перебування на сайті максимально комфортним, для цього за допомогою
        файлів cookie нам необхідно аналізувати поведінку, вподобання і Ваші інтереси, що допоможе нам поліпшити досвід
        взаємодії з Сайтом, визначити найбільш зручний інтерфейс і навігацію сервісу..
      </Typography>
      <Typography>
        Відповідно до класифікації Міжнародної торгової палати (International Chamber of Commerce), нами
        використовуються такі категорії файлів cookie:
      </Typography>
      <Typography>
        Строго необхідні файли cookie, які потрібні для переміщення користувачем по веб-сторінці і при використанні
        певних сервісів (для доступу до захищених сторінок, реєстрації та авторизації, здійснення пошуку по сайту,
        запам&apos;ятовування Ваших попередніх дій при переході на попередню сторінку в тій же сесії).
      </Typography>

      <Typography>
        Експлуатаційні файли cookie — агрегують інформацію про те, як використовується сайт. Такі дані зберігаються на
        Вашому пристрої між сеансами веб-браузера (час перебування на сайті, найбільш часто відвідувані сторінки,
        розуміння, які саме розділи і сервіси сайту були найбільш цікаві для Вас, ефективність тієї чи іншої рекламної
        та / або маркетингової кампанія і т.д .). Інформація, зібрана за допомогою експлуатаційних файлів cookie,
        призначена для статистичних та аналітичних задач. .
      </Typography>
      <Typography>
        Функціональні файли cookie — використовуються для збереження параметрів та конфігурацій, які зберігаються на
        Вашому пристрої між сеансами веб-браузера (ім&apos;я користувача, фото в профілі, інформація про залишені
        коментарі, мова сайту, місцезнаходження, відомості про те, чи надавалася Вам будь-яка інформація або обрані
        переваги раніше, а також інші параметри налаштування сайту). Такі файли cookie також дозволяють Вам дивитися
        відео, брати участь в інтерактивах (опитування, голосування) і взаємодіяти з соціальними мережами. .
      </Typography>
      <Typography>
        Деякі дані файлів cookie можуть надаватися третім сторонам, які мають дозвіл з боку веб-ресурсу, і виключно для
        зазначених вище цілей.
      </Typography>

      <Typography>
        Цільові файли cookie — використовуються для надання контенту, який може Вас зацікавити. Ці дані зберігаються на
        Вашому пристрої між сеансами веб-браузера (відстеження рекомендованого текстового, графічного, аудіо- та
        відеоматеріалу, з метою уникнути повторного показу, управління цільової рекламою, оцінки ефективності рекламних
        кампаній, інформація про відвідування користувачем інших ресурсів при переходах). Сайт може ділитися цією
        інформацією з іншими сторонами, включаючи медіа-клієнтів, рекламодавців, агентств і партнерів по суміжному
        бізнесу для того, щоб вони надавали якісну таргетовану рекламу..
      </Typography>
      <Typography>
        <strong>Cookie-файли сторонніх сервісів і сервісів аналітики:</strong>
      </Typography>
      <Typography>
        Для оперативної доставки, більш якісного відображення і детального аналізу контенту на Сайті, ми користуємося
        послугами, які є власністю інших сторонніх компаній, таких як Facebook, Twitter, Instagram, Alphabet Inc.,
        Hotjar і інші. Наведені, як приклад, компанії можуть використовувати файли cookie на своєму пристрої, під час
        роботи на сайті. Слід звернути увагу, що сайт не може вплинути на роботу файлів cookie, які використовуються
        цими сервісами. Всі необхідні відомості про їх використання можна дізнатися, відвідавши відповідний ресурс.
      </Typography>
      <List>
        <ListItem>
          Умови використання{' '}
          <a target='_blank' rel='noreferrer' href='https://marketingplatform.google.com/about/analytics/terms/ru/'>
            Google Analytics
          </a>
        </ListItem>
        <ListItem>
          Політика використання даних
          <a target='_blank' rel='noreferrer' href='https://www.hotjar.com/legal/policies/privacy/'>
            Hotjar
          </a>
        </ListItem>
        <ListItem>
          Політика використання{' '}
          <a
            target='_blank'
            rel='noreferrer'
            href='https://www.facebook.com/privacy/policy/?entry_point=data_policy_redirect&entry=0'
          >
            Facebook
          </a>
        </ListItem>
        <ListItem>
          Політика приватності
          <a target='_blank' rel='noreferrer' href='https://www.admitad.com/ua/privacy/'>
            Admitad
          </a>
        </ListItem>
        <ListItem>
          Політика конфіденційності
          <a target='_blank' rel='noreferrer' href='https://esputnik.com/politika-konfidencialnosti'>
            eSputnik v
          </a>
        </ListItem>
      </List>
      <Typography>
        <strong>Управління файлами cookie:</strong>
      </Typography>
      <Typography>
        Основні веб-браузери (перераховані нижче) налаштовані на автоматичний прийом файлів cookie. Для того, щоб їх
        відключити, скористайтеся функцією довідки у своєму браузері. Довідку можна викликати через меню або за
        допомогою кнопки F1.
      </Typography>
      <List>
        <ListItem>
          <a target='_blank' rel='noreferrer' href='https://privacy.microsoft.com/ru-ru/privacystatement'>
            Microsoft Edge
          </a>
        </ListItem>

        <ListItem>
          <a target='_blank' rel='noreferrer' href='https://www.mozilla.org/ru/privacy/websites/#cookies'>
            Mozilla Firefox
          </a>
        </ListItem>
        <ListItem>
          <a target='_blank' rel='noreferrer' href='https://support.google.com/chrome/answer/95647?hl=ru'>
            Google Chrome
          </a>
        </ListItem>
        <ListItem>
          <a target='_blank' rel='noreferrer' href='https://help.opera.com/ru/latest/web-preferences/#cookies'>
            Opera
          </a>
        </ListItem>

        <ListItem>
          <a target='_blank' rel='noreferrer' href='https://support.apple.com/uk-ua/guide/safari/sfri11471/mac'>
            Safari for macOS
          </a>
        </ListItem>
      </List>
      <Typography>
        <strong>Звертаємо увагу:</strong>
      </Typography>
      <List>
        <ListItem>
          конфігурація налаштувань файлів cookie для веб-браузерів мобільних пристроїв може відрізнятися;
        </ListItem>
        <ListItem>
          слід нагадати, що повноцінна робота з сайтом доступна тільки при використанні файлів cookie;
        </ListItem>
        <ListItem>
          відключення файлів cookie може призвести до обмеження доступу до змісту і до неповноцінного функціонування
          сервісів сайту.
        </ListItem>
      </List>
      <Typography>
        Щоб звернутися до нас з приводу використання файлів cookie, відправте повідомлення по електронній пошті на email
        client@apteka24.ua
      </Typography>
      <Typography>
        Якщо Ви не вмикаєте використання файлів cookie або навмисно видаляєте всі файли cookie зі свого веб-браузера, то
        при подальших відвідинах сайту Вам буде повторно запропоновано ввімкнення і використання файлів cookie.
      </Typography>

      <Typography>
        Інформація про Вас, отримана за допомогою файлів cookie, не продається і не поширюється у відкритому доступі, є
        власністю компанії, якій належить ресурс.
      </Typography>
      <h3>4. Посилання на інші сайти</h3>
      <Typography>
        Цей сайт містить посилання на інші сайти. Справжня Політика конфіденційності відноситься тільки до цього сайту,
        тому, коли Ви переходите за посиланням на інші сайти, Ви повинні прочитати їх власну політику конфіденційності.
        ТОВ «МІС-Cервіс» не несе відповідальності за політику конфіденційності або зміст таких веб-сайтів.
      </Typography>
      <h3>5. Умови безпеки зберігання персональних даних</h3>
      <Typography>
        Ми зберігаємо Ваші персональні дані до тих пір, поки це необхідно для виконання цілей, для яких вони були
        зібрані, як описано вище. Критерії, які ми використовуємо для визначення термінів зберігання персональних даних,
        включають наступне: зберігання відповідно до вимог законодавства та нормативних вимог. Ми можемо зберігати та
        використовувати Вашу інформацію для виконання наших юридичних зобов&apos;язань, вирішення спорів, запобігання
        зловживань.
      </Typography>
      <Typography>
        Ми прагнемо використовувати відповідні технічні та фізичні заходи безпеки для захисту Ваших особистих даних, які
        ми передаємо, зберігаємо або обробляємо іншим чином від випадкового або незаконного знищення, втрати, зміни,
        несанкціонованого розкриття або доступу.
      </Typography>
      <Typography>
        При використанні Вами сервісів на сторінках Сайту можуть бути присутніми коди інших інтернет-ресурсів і третіх
        осіб, в результаті чого такі інтернет-ресурси і треті особи отримують Ваші дані. Отже, ці інтернет-ресурси
        можуть отримувати і обробляти інформацію про те, що Ви відвідали ці сторінки, а також іншу інформацію, яку
        передає браузер користувача. Такими Інтернет-ресурсами можуть бути:
      </Typography>
      <List>
        <ListItem>системи банеропоказів (наприклад, DoubleClick for Publishers, Admixer, AdRiver та ін.)</ListItem>
        <ListItem>соціальні плагіни мереж (наприклад, Discus, Facebook, Twitter, Google+)</ListItem>
      </List>

      <Typography>
        Використання зазначених сервісів нам необхідно для оперативного аналізу відвідувань сайту, внутрішньої і
        зовнішньої оцінки відвідуваності сайту, глибини перегляду, активності користувачів. Дані, отримані від
        зазначених сервісів, ми не зберігаємо і не обробляємо.
      </Typography>
      <Typography>
        Відповідно, якщо в силу будь-яких причин Ви не бажаєте, щоб зазначені послуги отримували доступ до Ваших
        персональних даних, Ви можете за власним бажанням вийти зі свого аккаунта або профілю, очистити файли cookie
        (через свій браузер).
      </Typography>
      <h3>6. Захист персональних даних</h3>
      <Typography>
        ТОВ «МІС-Cервіс» використовує загальноприйняті стандарти технологічного та операційного захисту інформації та
        персональних даних від втрати, неправильного використання, зміни або знищення. При цьому, незважаючи на всі
        зусилля, ми не може гарантувати абсолютну захищеність від будь-яких загроз, які виникають поза межами
        регулювання нашою компанією. Нами забезпечується використання усіх відповідних зобов&apos;язань щодо дотримання
        конфіденційності, а також технічних і організаційних заходів безпеки для запобігання несанкціонованого або
        незаконного розголошення або обробки такої інформації і даних, їх випадкової втрати, знищення або пошкодження.
        Ми надаємо доступ до інформації і персональних даних тільки уповноваженим працівникам, які дали згоду на
        забезпечення конфіденційності такої інформації і даних відповідно до вимог ТОВ «МІС-Cервіс». Поширення
        персональних даних без згоди суб&apos;єкта персональних даних або уповноваженої ним особи дозволяється у
        випадках, визначених законом, і лише (якщо це необхідно) в інтересах національної безпеки, економічного
        добробуту та прав людини.
      </Typography>
      <h3>7. Ваші права як суб&apos;єкта персональних даних</h3>
      <Typography>
        Компанія доводить до Вашого відома інформацію про Ваші права як суб&apos;єкта персональних даних, які
        врегульовані Законом України «Про захист персональних даних», а саме:
      </Typography>
      <List>
        <ListItem>
          знати про джерела збору, місцезнаходження своїх персональних даних, мету їх обробки, місцезнаходження або
          місце проживання (перебування) власника чи розпорядника персональних даних або надати відповідне доручення
          щодо отримання цієї інформації уповноваженим ним особам, крім випадків, встановлених законом;
        </ListItem>
        <ListItem>
          отримувати інформацію про умови надання доступу до персональних даних, зокрема, інформацію про третіх осіб,
          яким передаються персональні дані;
        </ListItem>

        <ListItem>на доступ до своїх персональних даних;</ListItem>
        <ListItem>
          отримувати не пізніше, ніж за тридцять календарних днів з дня надходження запиту, крім випадків, передбачених
          законом, відповідь про те, чи обробляються персональні дані, а також отримувати зміст таких персональних
          даних;
        </ListItem>

        <ListItem>
          пред&apos;являти вмотивовану вимогу власнику персональних даних із запереченням проти обробки своїх
          персональних даних;
        </ListItem>
        <ListItem>
          пред&apos;являти вмотивовану вимогу щодо зміни або знищення своїх персональних даних будь-яким власником і
          розпорядником персональних даних, якщо ці дані обробляються незаконно чи є недостовірними;
        </ListItem>
        <ListItem>
          на захист своїх персональних даних від незаконної обробки та випадкової втрати, знищення, пошкодження у
          зв&apos;язку з умисним приховуванням, ненаданням чи несвоєчасним їх наданням, а також на захист від надання
          відомостей, що є недостовірними чи ганьблять честь, гідність та ділову репутацію фізичної особи;
        </ListItem>

        <ListItem>
          звертатися зі скаргами на обробку своїх персональних даних до Уповноваженого Верховної Ради України з прав
          людини або до суду;
        </ListItem>
        <ListItem>
          застосовувати засоби правового захисту у разі порушення законодавства про захист персональних даних;
        </ListItem>

        <ListItem>
          вносити застереження стосовно обмеження права на обробку своїх персональних даних під час надання згоди;
        </ListItem>
        <ListItem>відкликати згоду на обробку персональних даних;</ListItem>
        <ListItem>знати механізм автоматичної обробки персональних даних;</ListItem>
        <ListItem>на захист від автоматизованого рішення, яке має правові наслідки.</ListItem>
      </List>
      <Typography>
        Для поновлення, отримання доступу, внесення змін, блокування або видалення своїх персональних даних, відкликання
        згоди на обробку персональних даних, яке Вами надано нам згідно з цією Політикою, або в разі наявності будь-яких
        зауважень, побажань чи претензій щодо Ваших персональних даних, які нами обробляються, будь ласка, звертайтеся
        до нас: по електронній пошті client@apteka24.ua або напишіть листа на адресу: 49100, м Дніпро, пр.Героїв, д.
        11Л, каб. 321.
      </Typography>
      <h3>Зміни в Політиці конфіденційності та захисту персональних даних</h3>
      <Typography>
        Ми залишаємо за собою право змінювати дану Політику конфіденційності в будь-який час на власний розсуд та без
        попереднього повідомлення. Якщо ми внесемо зміни в справжню Політику конфіденційності, вони будуть розміщені на
        веб-сайті, щоб Ви володіли актуальною інформацією. Нова редакція Політики вступає в силу з моменту її розміщення
        на сайті, якщо інший термін не передбачено новою редакцією Політики. Якщо після ознайомлення зі змінами Ви не
        відмовитеся від їх прийняття в письмовій формі, це буде означати, що Ви погоджуєтеся з відповідними змінами
        Політики. Пропонуємо періодично переглядати Політику для того, щоб бути проінформованими про зміни або
        доповнення.
      </Typography>
    </Wrapper>
  )
}
