import React, { useState } from 'react'
import { Typography } from '@mui/material'
import styled from '@emotion/styled'
import { ListItem, List } from '@material-ui/core'
import { useSelector } from 'react-redux'
import { mainInfoSelector } from 'redux/main/mainSelectors'
const Wrapper = styled.div`
  background-color: #f8f8f8;
  border-radius: 25px;
  max-width: 1300px;
  margin: 0 auto;
  padding: 10px;
  & button {
    background-color: transparent;
    border: none;
    color: var(--greenColor);
    font-weight: 600px;
  }
  & * {
    font-family: var(--primaryFont);
  }
  & li::before {
    content: '';
    display: block;
    width: 8px;
    height: 8px;
    border-radius: 50%;
    background: var(--greenColor);
    position: absolute;
    top: 13px;
    left: -20px;
  }
  & .gradient {
    height: 200px;
    max-width: 1400px;
    width: 100%;
    position: absolute;
    margin-top: -200px;
    background: linear-gradient(
      180deg,
      rgba(255, 255, 255, 0) 0%,
      rgba(255, 255, 255, 0.3) 35%,
      rgba(255, 255, 255, 1) 100%
    );
  }
  & h2 {
    text-align: center;
    max-width: 800px;
    margin: 0 auto 20px;
  }
`

const WrapperInner = styled.div<{ isOpen: boolean }>`
  height: ${props => (props.isOpen ? '100%' : '300px')};
  overflow: hidden;
  padding: 30px;
`
const Description = () => {
  const company = useSelector(mainInfoSelector)
  const [open, setOpen] = useState(false)

  const onOpenHandler = () => {
    setOpen(prev => !prev)
  }
  return (
    <Wrapper>
      <WrapperInner isOpen={open}>
        <h2>{`${company?.name}: якісні медикаменти, медичні товари та лікувальна косметика для здоров'я українців`}</h2>
        <Typography>
          {`${company?.link} — це онлайн-сервіс національної мережі ${company?.name}, що дає можливість кожному покупцю швидко
          та без труднощів придбати будь-який лікарський препарат за оптимальною ціною. Ми дбаємо про своїх клієнтів:
          завдяки нашій якісній продукції тепер стало легко позбутися неприємних симптомів та підтримувати своє
          здоров'я. Досвідчені фармацевти допоможуть обрати необхідні ліки, а професійні рекомендації заощадять час
          покупців.`}
        </Typography>
        <h3>{`Чому варто вибирати ${company?.name}:`}</h3>
        <List>
          <ListItem>
            великий вибір не тільки фармацевтичної продукції (лікарських засобів, медичних виробів), а і харчових
            продуктів для спеціального дієтичного споживання, функціональних харчових продуктів та дієтичних добавок, що
            економить час та дозволяє здійснити покупку в одному місці;
          </ListItem>

          <ListItem>
            великий асортимент сертифікованої «аптечної» косметики європейських брендів для догляду будь-якого типу
            шкіри, зокрема, і такої, що ексклюзивно від виробника імпортується на замовлення мережі, а отже багато з цих
            засобів можна знайти в Україні лише на полицях аптек «Доброго дня»;
          </ListItem>

          <ListItem>
            {`програма «піклування» про клієнта, яка дозволяє здійснювати покупки, накопичувати бонуси та використовувати
            їх у аптеках ${company?.name};`}
          </ListItem>
          <ListItem>акції та знижки на продукцію, про які інформація надається додатково;</ListItem>
          <ListItem>компетентність працівників;</ListItem>

          <ListItem>зручність у оформленні онлайн-замовлення;</ListItem>
          <ListItem>
            доставка продукції власною кур&apos;єрською службою або кур’єрськими службами операторів поштового зв’язку;
          </ListItem>

          <ListItem>надійне пакування продукції, термобокси, ретельна перевірка замовлень до їх відправлення.</ListItem>
        </List>
        <Typography>
          Ми гарантуємо високу якість продукції, що підтверджена відповідними сертифікатами, дотримуємось усіх вимог до
          умов та термінів зберігання.
        </Typography>
        <h3>{`Які товари можна замовити на сайті ${company?.name}?`}</h3>
        <Typography>
          {` Асортимент ${company?.name} представлений лікарськими засобами та продукцією медичного призначення
          українських та зарубіжних фармацевтичних компаній. Весь товар, який пропонується до уваги клієнтів ${company?.name}, сертифікований, відповідає європейським та міжнародним стандартам якості.`}
        </Typography>
        <Typography>{`Каталог ${company?.name} містить наступні позиції:`}</Typography>
        <List>
          <ListItem>
            Медикаменти. До цієї категорії належать засоби для покращення функції травної системи, антибіотики,
            препарати для серця, ліки від алергії, судинні препарати, анальгетики та протизапальні медикаменти, ліки для
            шлунка та ін.
          </ListItem>

          <ListItem>
            {`Лікувальна косметика. Ця категорія товарів ${company?.name} призначена для щоденного догляду, а також
            профілактики та лікування проблем шкіри. В асортименті засоби для чутливої, проблемної та масної шкіри,
            термальна та міцелярна вода, засоби від зморшок, для екстра зволоження, догляду за губами та шкірою навколо
            очей, засоби для боротьби з куперозом тощо.`}
          </ListItem>
          <ListItem>
            {' '}
            Вітамінні комплекси та БАДи. До цієї групи входять вітаміни та мікроелементи для дітей, вагітних, людей
            похилого віку та інших категорій клієнтів, БАДи для місцевого використання (венотоніки, загоювальні,
            протипедикульозні тощо). Великою популярністю користуються засоби для схуднення у вигляді трав&apos;яних
            чаїв, кремів та препаратів у таблетках.
          </ListItem>

          <ListItem>
            Гігієнічні та доглядові засоби. Серед товарів цієї категорії — шампуні, продукти для купання та догляду,
            продукція для жіночої інтимної гігієни, інструменти для педикюру та манікюру.
          </ListItem>
          <ListItem>
            {` Дитяча продукція. У каталозі ${company?.name}  будь-яка жінка може обрати для дитини дитяче харчування,
            памперси та пелюшки, гігієнічні засоби, різноманітні аксесуари, важливі для зростання та розвитку малюка
            (пустушки, іграшки, напувалки тощо). Молодим мамам доступні молоковідсмоктувачі, накладки на соски,
            косметика для догляду за молочними залозами.`}
          </ListItem>
          <ListItem>
            {`Товари медичного призначення. У цій рубриці ${company?.name}  покупець знайде пристрої для важких хворих
            та людей з обмеженими можливостями (милиці, бандажі, ортопедичне взуття, підкладні судна, сечоприймачі). До
            цієї категорії належать прилади для вимірювання тиску, температури, глюкози крові, контрацептиви, тести для
            експрес-діагностики тощо.`}
          </ListItem>
        </List>
        <h3>Як замовити товар в онлайн-аптеці?</h3>
        <Typography>
          {`Під час покупки засобів на сайті ${company?.name} можна застосувати пошуковий рядок або використовувати
          зручний фільтр. Крім того, можна скористатися вкладкою "Бренд" – це дозволить швидко знайти
          необхідну продукцію з урахуванням її виробника.`}
        </Typography>
        <Typography>
          Аби дізнатися вартість обраного товару, на сайті аптеки можна ознайомитися з прайсом. У ньому ви знайдете ціни
          більш ніж на 10 тисяч медикаментів, біологічно активних добавок, доглядових засобів, виробів медичного
          призначення тощо.
        </Typography>
        <Typography>
          {`Замовлений товар покупець ${company?.name} може отримати в одній з аптек мережі. Обрати найближчу точку
          можна, скориставшись онлайн-картою на сайті. Завдяки злагодженій оперативній роботі команди ${company?.name} покупцю гарантована своєчасна доставка товару.`}
        </Typography>

        <Typography>
          Оплата проводиться в момент отримання замовлення в аптеці будь-яким зручним для покупця способом: банківською
          карткою або готівкою. При цьому важливо перевірити, чи отримані ліки або медичний виріб відповідають якості та
          замовленню.
        </Typography>
        <Typography>
          {` З усіх питань покупці мережі ${company?.name} можуть отримати детальну інформацію у консультантів
          кол-центру. Телефон інформаційної підтримки – ${company?.phone}, працює 24/7.`}
        </Typography>
      </WrapperInner>
      {!open && <div className='gradient'></div>}
      <button onClick={onOpenHandler}>{open ? 'Сховати' : 'Показати'}</button>
    </Wrapper>
  )
}

export default Description
