import React from 'react'
import styled from '@emotion/styled'
import { Typography } from '@mui/material'

const Wrapper = styled.div`
  & * {
    font-family: var(--primaryFont);
  }
  & li::before {
    content: '';
    display: block;
    width: 8px;
    height: 8px;
    border-radius: 50%;
    background: var(--greenColor);
    position: absolute;
    top: 13px;
    left: -20px;
  }
`
export const MedicalExperts = () => {
  return (
    <Wrapper>
      <Typography>
        apteka24.ua співпрацює з висококваліфікованими медичними експертами з метою забезпечення надійності,
        релевантності, достовірності та наукової доказовості всіх матеріалів, опублікованих на сайті apteka24.ua. Ми
        приділяємо особливу увагу тому, щоб зміст контенту, товари та послуги відповідали найвищим медичним стандартам.
      </Typography>
      <Typography>
        Зміни медичної галузі, поява нових наукових даних і сучасні відкриття вчених стають причиною того, що в мережі
        стає занадто багато застарілої та непідтвердженої інформації, яка може вводити в оману. Ми вважаємо, що у
        медицині та в питаннях здоров&apos;я це неприпустимо.
      </Typography>

      <Typography>
        Тому ми зібрали спеціальну команду висококваліфікованих лікарів різних спеціалізацій та фармацевтів, які разом з
        нами мають мету надати людям можливість отримувати тільки точну, достовірну, науково доведену, обґрунтовану,
        актуальну і релевантну інформацію медичного і наукового характеру.
      </Typography>
      <Typography>
        Весь контент на сайті apteka24.ua (як давно існуючий, так і новий) перевірений, відкоректований, оновлений в
        міру надходження нових наукових і офіційних даних, а також затверджений нашими медичними експертами.
      </Typography>
      <Typography>
        Інструкції, описи, характеристики препаратів, а також статті блогу і тексти категорій каталогу перевіряють
        досвідчені лікарі і фармацевти, які спеціалізуються в області, що висвітлюється в кожному конкретному виді
        контенту.
      </Typography>

      <Typography>
        Редакторська команда медичних експертів виступає цензорами сайту apteka24.ua, створює експертні матеріали та
        висвітлює проблемні питання здоров&apos;я в докладних інтерв&apos;ю.
      </Typography>
      <h3>Медичні цензори лікарських засобів</h3>
      <Typography>
        Невід&apos;ємна частина команди apteka24.uа — це фармацевти, які виступають медичними цензорами інформації, що
        надається на сайті apteka24.ua у якості описів для лікарських засобів і медичних товарів.
      </Typography>

      <Typography>
        Фахівці з фармакології перевіряють інструкції до препаратів і товарів медичного призначення, їх опис,
        характеристики та підбір аналогів, а також стежать за тим, щоб всі інструкції на сайті відповідали офіційному
        джерелу —{' '}
        <a rel='noreferrer' target='_blank' href='http://www.drlz.com.ua/'>
          {' '}
          Державний реєстр лікарських засобів України
        </a>
      </Typography>

      <Typography>
        Ми вважаємо, що інструкція до лікарського засобу — це його «паспорт», це керівництво по використанню і ключ до
        здоров&apos;я. А тому точність, повнота і доступність інструкції вкрай важливі — і саме тому ми забезпечуємо
        верифікацією усіх карток товарів згідно з редакційною політикою apteka24.ua.
      </Typography>
      <h3>Медичні цензори інформування з питань здоров&apos;я</h3>
      <Typography>
        Оскільки зміни у медичній галузі відбуваються дуже швидко, з&apos;являються нові наукові дані, а попередні
        положення з часом відкидаються, то весь контент apteka24.ua, що інформує з питань здоров&apos;я, проходить
        обов&apos;язкову перевірку та затвердження медичними цензорами, в ролі яких виступають висококваліфіковані
        лікарі з великими науковими знаннями та багаторічним практичним досвідом.
      </Typography>

      <Typography>
        Команда медичних експертів гарантує, що інформація в контенті блогу точна, актуальна та орієнтована на пацієнта.
      </Typography>
      <Typography>
        Відповідно до редакційної політики, статті блогу з питань медицини та здоров&apos;я проходять обов&apos;язкову
        перевірку та коректуру з боку медичних експертів. Перевірку і затвердження статей здійснює лікар відповідної
        компетенції, що спеціалізується на питаннях медичної галузі, до якої відноситься стаття.
      </Typography>

      <Typography>
        При висвітленні спірних тверджень, які не мають на цей час доказових наукових даних, ми посилаємося на думку і
        схвалення лікаря відповідної компетенції.
      </Typography>
      <Typography>
        Також лікарі з команди медичних експертів apteka24.ua ведуть просвітницьку діяльність, публікують власні
        авторські наукові матеріали та висвітлюють найбільш важливі питання здоров&apos;я в інтерв&apos;ю.
      </Typography>
    </Wrapper>
  )
}
