import React from 'react'
import styled from '@emotion/styled'
import { Typography } from '@mui/material'
const Wrapper = styled.div`
  & * {
    font-family: var(--primaryFont);
  }
  & li::before {
    content: '';
    display: block;
    width: 8px;
    height: 8px;
    border-radius: 50%;
    background: var(--greenColor);
    position: absolute;
    top: 12px;
    left: -10px;
  }
`
export const Missiya = () => {
  return (
    <Wrapper>
      <h2>Чому наш шлях такий?</h2>
      <Typography>
        Кількість лікарських помилок і помилок самолікування, на нашу думку, досягає критичної межі. Ще більше нас
        пригнічує те, що ніхто не намагається виправити цю ситуацію. Як не сумно це визнавати, але аптечний бізнес, як і
        будь-який інший бізнес, здебільшого орієнтований на отримання прибутку. Але для нас дуже важливо, щоб ми
        приносили користь, а наш ресурс допомагав людям не тільки знайти відповіді на всі їхні запитання про
        здоров&apos;я, а й допомагав наблизитися до свідомості у всьому, що стосується здоров&apos;я, самопочуття,
        медицини та застосування лікарських засобів.
      </Typography>
      <Typography>
        Тому ми бачимо своєю місією допомогти людям досягти свідомості і освіченості в сфері медицини і здоров&apos;я.
        Для реалізації цієї місії ми надаємо такий сервіс і такі знання, які дозволяють людям дізнатися більше про свій
        організм, про фізіологічні і психічні процеси, про взаємодію ліків, про їх побічні ефекти і причини, чому вони
        можуть бути ефективні, щоб кожна людина могла прийняти усвідомлене рішення щодо свого здоров&apos;я.
      </Typography>
      <h2>Як ми досягаємо своєї мети?</h2>
      <Typography>
        Конкретним способом вирішення цих завдань являється наш блог про здоров&apos;я, в якому ми висвітлюємо в статтях
        найактуальніші питання, докладно, і, головне, доступно, розповідаємо про те, що відбувається з людським
        організмом, і, звичайно, даємо зрозуміти кожному читачеві, що наша інформація може принести спокій і розуміння,
        але, звичайно, не може замінити консультацію, тому що тільки лікар може поставити правильний діагноз
      </Typography>
      <Typography>
        Ми скрупульозно підходимо до заповнення інструкцій і описів препаратів, подаємо інформацію дуже докладно і
        доступно для широких мас населення, щоб кожна людина могла зрозуміти складні медичні терміни і розібратися в
        питаннях медицини. Саме це допомагає нашим відвідувачам приймати усвідомлені рішення при лікуванні і купівлі
        ліків.
      </Typography>

      <Typography>
        Реалізуючи свідомий підхід до медицини і здоров&apos;ю, ми надаємо нашим клієнтам можливість купувати тільки
        ліцензовані препарати і товари медичного призначення, займаємося просвітницькою діяльністю, попереджаємо про
        побічні ефекти, про можливість передозування і взаємодію лікарських засобів, закликаємо не займатися
        самолікуванням і надаємо інформацію з питань здоров&apos;я, яка обов&apos;язково проходить перевірку не тільки
        нашою редакцією, а й командою медичних експертів, в яку входять висококваліфіковані лікарі з багаторічним
        практичним досвідом і які щиро відстоюють інтереси пацієнтів.
      </Typography>
    </Wrapper>
  )
}
