import React from 'react'
import styled from '@emotion/styled'
import { Typography } from '@mui/material'

const Wrapper = styled.div`
  & * {
    font-family: var(--primaryFont);
  }
  & li::before {
    content: '';
    display: block;
    width: 8px;
    height: 8px;
    border-radius: 50%;
    background: var(--greenColor);
    position: absolute;
    top: 13px;
    left: -20px;
  }
`
export const MarketingPolicy = () => {
  return (
    <Wrapper>
      <Typography>
        Якщо ви знаходитесь тут, значить, ви на крок ближче до здоров&apos;я і благополуччя. А ми в електронній медичній
        інформаційній системі {window.location.host} робимо все можливе, щоб допомогти вам у цьому: підбираємо точні
        інструкції, пишемо інформативні статті і розміщуємо рекламні банери, акції, інформаційні бюлетені та підкасти
        тільки з корисною для вас інформацією.
      </Typography>
      <Typography>
        Оскільки люди звертаються до нас з унікальними проблемами, з особистими історіями і запитаннями, ми дуже уважно
        до них прислухаємося і ставимо інтереси здоров&apos;я та благополуччя людини на перше місце в нашій компанії.
      </Typography>

      <Typography>
        Якраз з такого світогляду і ідеї виникає наш підхід до реклами на сайті електронної медичної інформаційної
        системи {window.location.host}, який відповідає, підтримує і доповнює редакційну політику електронної медичної
        інформаційної системи {window.location.host}.
      </Typography>
      <h3>Рекламна політика</h3>
      <Typography>
        Електронна медична інформаційна система {window.location.host} отримує фінансування від реклами і спонсорського
        контенту. Реальність така, що фінансування від наших рекламодавців дозволяє нам покривати більшу кількість
        витрат на створення якісного контенту і надавати більш ефективний сервіс.
      </Typography>
      <Typography>
        Будьте впевнені, ми абсолютно незалежні в своїй редакційній автономії. Ми ніколи не дозволяємо спонсорам
        впливати на створюваний нами контент і послуги, що надаються..
      </Typography>
      <Typography>
        У нас є особливі правила по рекламі і спонсорству, яким ми слідуємо, щоб реклама ніколи не заважала редакційній
        чесності та надійності.
      </Typography>

      <Typography>
        Вся реклама, яку ви бачите на сайті електронної медичної інформаційної системи {window.location.host},
        відповідає принципу корисності та обгрунтованості. Ми самі вибираємо рекламу, не дозволяємо нам нав&apos;язувати
        точку зору рекламодавця і ніколи не станемо рекламувати те, що може потенційно нашкодити, є невиправдано дорогим
        або не несе доказової користі. Ми чітко розрізняємо спонсорований і не спонсорований контент і не допускаємо
        перетину одного з іншим.
      </Typography>
      <Typography>
        У деяких випадках електронна медична інформаційна система {window.location.host} може створювати спільний або
        брендований контент у співпраці з нашими спонсорами та / або представляти контент, створений нашими спонсорами.
        Однак ми ніколи не суперечимо ідеї корисності і благополуччя.
      </Typography>

      <Typography>У своїй рекламній політиці ми дотримуємося чітких правил:</Typography>
      <h3>№1 Перевірка рекламних оголошень</h3>
      <Typography>
        Ми на власний розсуд визначаємо типи реклами, які будуть відображені на ресурсах електронної медичної
        інформаційної системи {window.location.host}. Ми залишаємо за собою право відхилити, скасувати або видалити
        будь-яку рекламу в будь-який час і з будь-якої причини, яку вважатимемо досить вагомою для подібної дії. Однією
        з причин для видалення реклами може стати скарга на оголошення, потенційний ризик можливої шкоди, відсутність
        явної користі.
      </Typography>

      <Typography>
        Ми негайно повідомимо рекламодавця про відхилення, скасування або видалення будь-якого оголошення разом з
        поясненням. Ми також залишаємо за собою право визначати відповідне розміщення реклами на ресурсах електронної
        медичної інформаційної системи {window.location.host}.
      </Typography>
      <h3>№2 Відмова від підтримки рекламованих товарів або послуг</h3>
      <Typography>
        Ми не підтримуємо рекламовані на нашому ресурсі товари або послуги. Хоча деяка продукція може з&apos;являтися на
        нашому сайті в форматі реклами, ні за яких обставин це не може розглядатися як схвалення рекламованих товарів,
        послуг або бренду, який виробляє, поширює або просуває ці товари і послуги.
      </Typography>
      <Typography>
        У деяких випадках електронна медична інформаційна система {window.location.host} може оцінювати певні товари або
        послуги і складати з ними рейтинги. Ці рейтинги формуються виключно редакційною командою без урахування
        будь-яких фінансових або рекламних відносин, які можуть існувати з компаніями, що надають товари або послуги.
      </Typography>
      <h3>№3 Фільтрація рекламного контенту</h3>
      <Typography>
        Ми ретельно відбираємо усю рекламу, що відображається на нашому ресурсі, і не приймаємо певні види реклами..
      </Typography>
      <Typography>
        Ми не приймаємо рекламу, яка є неточною, суперечить здоровому глузду або ту, що може принести потенційну шкоду.
      </Typography>

      <Typography>
        Фармацевтична реклама дозволена тільки для затверджених медикаментів і товарів медичного призначення, визначених
        Міністерством охорони здоров&apos;я України і Державним реєстром лікарських засобів України. При цьому
        рекламовані товари повинні бути присутніми на ринку і бути легко доступними.
      </Typography>
      <Typography>
        Електронна медична інформаційна система {window.location.host} ні в якому разі не допускає розміщення реклами
        шкідливих, незаконних або небажаних товарів і послуг. Оголошення не повинні містити шахрайську інформацію, що
        вводить в оману, або образливі матеріали, включаючи матеріали, які спотворюють, висміюють або погрожують окремій
        людині або групі осіб, суперечачи принципу інклюзивності на підставі віку, кольору шкіри, національного
        походження, раси, релігії, статі, сексуальної орієнтації або інвалідності.
      </Typography>

      <Typography>
        Оголошення не повинні бути пов&apos;язані з алкоголем, порнографією, тютюном, імітацією новин або надзвичайної
        ситуації. Всі оголошення повинні чітко ідентифікувати рекламодавця. Будь-яке оголошення, яке подано двозначно і
        може бути невірно витлумачене як рекламне, буде чітко позначено як реклама.
      </Typography>
      <h3>№4 Розмежування реклами і редакційного контенту</h3>
      <Typography>
        У кожному разі при розміщенні реклами ми проводимо чітку межу між рекламними оголошеннями і редакційними
        матеріалами. Вся реклама на електронній медичній інформаційній системі {window.location.host} чітко і
        недвозначно позначена як така плашкою «Промо» або «Акція». Натиснувши на оголошення або банер, користувач
        перейде на сторінку рекламодавця або спонсора, розташовану на сайті електронної медичної інформаційної системи{' '}
        {window.location.host}.
      </Typography>

      <Typography>
        Редакційний контент, спонсорований рекламодавцями, регулюється нашою редакційною політикою і розглядається
        редакцією і командою медичних експертів.
      </Typography>
      <h3>№5 Посилання на товари в редакційному контенті</h3>
      <Typography>
        При створенні редакційних матеріалів наші автори статей іноді використовують посилання на відповідні товари і
        медикаменти, розміщені на сайті для продажу, які, на їхню думку, можуть бути корисними для наших читачів.
      </Typography>
      <Typography>
        Незважаючи на те, що всі медикаменти, товари і послуги, освітлені в статтях, вибираються незалежно і
        неупереджено командою медичних експертів, ми хочемо, щоб ви знали, що електронна медична інформаційна система
        {window.location.host} отримує прибуток, якщо ви зробите покупку пропонованого товару після натискання на одне з
        посилань, які ми надаємо.
      </Typography>
    </Wrapper>
  )
}
